//==========================================================================
//文件名称：pit.h
//功能概要：KL25 pit底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2016-3-20   V4.0
//==========================================================================
#ifndef _PIT_H
#define _PIT_H
//1 头文件
#include "common.h"

//2 宏定义
#define CH_0             0
#define CH_1             1
#define PIT_WORK_FREQ    BUS_CLK_KHZ
//获取中断标志
#define PIT_GET_FLAG(index)      (PIT_TFLG(index) & PIT_TFLG_TIF_MASK) == \
                                  PIT_TFLG_TIF_MASK)
//清中断标志
#define PIT_CLEAR_FLAG(index)    (PIT_TFLG(index) |= PIT_TFLG_TIF_MASK)

//==========================================================================
//函数名称: pit_init                                                         
//函数返回: 无                                          
//参数说明: channel:PIT模块的通道号，0或1。
//         freq:系统总线时钟频率，单位KHz。例:系统总线时钟为24MHz，则freq=24000。
//         int_ms:中断周期，以ms为单位。系统总线时钟为24MHz，最大值为178956ms
//功能概要: PIT模块初始化。
//调用举例：pit_init(CH_0,PIT_WORK_FREQ,1000);即初始化PIT模块的0通道使用总线
//时钟频率，中断周期为1秒。
//==========================================================================
void pit_init(uint_8 channel,uint_16 freq,uint_32 int_ms);

//==========================================================================
//函数名称: pit_enable_int
//参数说明: channel:PIT模块的通道号，0或1。
//函数返回: 无
//功能概要: 使能某一通道的PIT中断。
//调用举例：pit_enable_int(CH_0);使能PIT模块的通道0中断。
//==========================================================================
void pit_enable_int(uint_8 channel);

//==========================================================================
//函数名称: pit_disable_int
//参数说明: channel:PIT模块的通道号，0或1。
//函数返回: 无
//功能概要: 禁止某一通道的PIT中断。
//调用举例：pit_disable_int(CH_0);禁止PIT模块的通道0中断。
//==========================================================================
void pit_disable_int(uint_8 channel);

#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
