//===========================================================================
//文件名称：smc.h
//功能概要：smc底层驱动构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2013-4-20   
//===========================================================================
#ifndef _SMC_H
#define _SMC_H

#include "common.h"   //包含公共要素头文件

//===========================================================================
//函数名称：sleep
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入WAIT（sleep）模式，执行WFI指令进入该模式。
//===========================================================================
void sleep (void);

//===========================================================================
//函数名称：deepsleep
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入STOP（deepsleep）模式，执行WFI指令进入该模式。
//===========================================================================
void deepsleep (void);
//===========================================================================
//函数名称：enter_wait
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入wait模式。
//===========================================================================
void enter_wait(void);
//===========================================================================
//函数名称：enter_stop
//函数返回：无
//参数说明：
//  0x00 = STOP   - 正常停止模式
//  0x40 = PSTOP1 - 部分停止模式，系统时钟，总线时钟被关闭
//  0x80 = PSTOP2 - 部分停止模式，系统时钟关闭，总线时钟开启
//  0xC0 = 保留
//功能概要：配置ARM系统控制寄存器进入stop模式。
//===========================================================================
void enter_stop(unsigned char partial_stop_opt);

//===========================================================================
//函数名称：enter_vlpr
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入vlpr模式。
//===========================================================================
int enter_vlpr(void);

//===========================================================================
//函数名称：exit_vlpr
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器退出vlpr模式。
//===========================================================================
void exit_vlpr(void);

//===========================================================================
//函数名称：enter_vlps
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入vlps模式。
//===========================================================================
void enter_vlps(void);

//===========================================================================
//函数名称：enter_lls
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入lls模式。
//===========================================================================
void enter_lls(void);
//===========================================================================
//函数名称：enter_vlls3
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入vlls3模式。
//===========================================================================
void enter_vlls3(void);

//===========================================================================
//函数名称：enter_vlls1
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入vlls1模式。
//===========================================================================
void enter_vlls1(void);

//===========================================================================
//函数名称：enter_vlls0
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入vlls0模式。
//===========================================================================
void enter_vlls0(unsigned char PORPO_value );

//===========================================================================
//函数名称：enter_vlls0_nopor
//函数返回：无
//参数说明：无
//功能概要：配置ARM系统控制寄存器进入vlls0模式，上电复位电路禁止。
//===========================================================================
void enter_vlls0_nopor(void);

#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
