#ifndef _DEVICE_IO_H_
#define _DEVICE_IO_H_

struct znFAT_IO_Ctl
{
 UINT32 just_sec;
 UINT8  just_dev;
};

UINT8 znFAT_Device_Init(void);

//=====================================================================================
//函数名: USB_Class_Read_Sector
//功  能: 设备层函数用于读取U盘的一个扇区
//参  数: addr：要读取的扇区号
//       buffer:存放读取数据的缓冲区
//返  回: 0=成功；1=失败
//备  注：调用USB设备层函数usb_read_sector读取相应的数据
//=====================================================================================
UINT8 USB_Class_Read_Sector(UINT32 addr,UINT8 *buffer);

//===================================================================================
//函数名: USB_Class_Read_nSector
//功  能: 读多个扇区
//参  数: nsec:扇区的个数
//       addr：当前扇区号
//       buffer:存放读取的数据的缓冲区
//返  回: 0=成功；1=失败
//备  注：调用USB设备层函数usb_read_sector读取相应的数据
//====================================================================================
UINT8 USB_Class_Read_nSector(UINT32 nsec,UINT32 addr,UINT8 *buffer);

//=====================================================================================
//函数名: USB_Class_Write_Sector
//功  能:向USB设备(U盘)相应扇区写数据
//参  数: addr：当前扇区号
//       buffer:存放读取的数据的缓冲区
//返  回: 0=成功；1=失败
//备  注：调用USB设备层函数usb_write_sector读取相应的数据
//=====================================================================================
UINT8 USB_Class_Write_Sector(UINT32 addr,UINT8 *buffer);

//===================================================================================
//函数名: USB_Class_Write_nSector
//功  能: 向USB设备(U盘)的多个扇区写数据
//参  数: nsec：要写入数据的扇区个数
//       addr：当前扇区号
//       buffer:存放要写入的数据的缓冲区
//返  回: 0=成功；1=失败
//备  注：调用USB设备层函数usb_write_sector将数据进行写入
//====================================================================================
UINT8 USB_Class_Write_nSector(UINT32 nsec,UINT32 addr,UINT8 *buffer);

//===================================================================================
//函数名: znFAT_Device_Clear_nSector
//功  能: 将USB设备(U盘)的多个扇区清空
//参  数: nsec：要清空的扇区个数
//       addr:当前扇区号
//返  回: 0=成功；1=失败
//备  注：调用USB设备层函数usb_write_sector将0写入到相应的多个扇区
//====================================================================================
UINT8 znFAT_Device_Clear_nSector(UINT32 nsec,UINT32 addr);

#endif
