//=====================================================================
// 文件名称：lcd.h
// 功能概要：lcd构件头文件
// 版权所有: 苏州大学嵌入式中心(sumcu.suda.edu.cn)
// 版本更新: 2011-12-06  V1.0；  2016-05-02  V6.0（WYH)
//=====================================================================

#ifndef _LCD_H     //防止重复定义（_LCD_H  开头)
#define _LCD_H

#include "common.h"    //包含公共要素头文件
#include "gpio.h"      //包含gpio头文件

//LCD硬件接线
#define LCD_RS  (PTD_NUM|7)    //LCD寄存器选择信号引脚
#define LCD_RW  (PTD_NUM|6)    //LCD读写信号引脚
#define LCD_E   (PTD_NUM|5)    //LCD读写信号引脚
#define LCD_D0  (PTD_NUM|4)    //LCD数据引脚
#define LCD_D1  (PTD_NUM|3)
#define LCD_D2  (PTD_NUM|2)
#define LCD_D3  (PTD_NUM|1)
#define LCD_D4  (PTD_NUM|0)
#define LCD_D5  (PTC_NUM|17)
#define LCD_D6  (PTC_NUM|16)
#define LCD_D7  (PTC_NUM|13)

//======================================================================
//函数名称：LCDInit
//函数返回：无
//参数说明：无
//功能概要：LCD初始化。
//======================================================================
void LCDInit();

//======================================================================
//函数名称：LCDShow
//函数返回：无
//参数说明：data[32]：需要显示的数组
//功能概要：通过液晶显示data中的32字节数据。
//======================================================================
void LCDShow(uint_8 data[32]);

#endif  //防止重复定义（结尾）
