//=====================================================================
// 文件名称：lcd.c
// 功能概要：lcd构件头文件
//=====================================================================
#include "lcd.h"

//8个数据位引脚，使用数组，方便循环编程
static uint_16 LCD_D[8]=
{
    LCD_D0,LCD_D1,LCD_D2,LCD_D3,LCD_D4,LCD_D5,LCD_D6,LCD_D7
};

//内部函数原型声明
void LCDCommand(uint_8 RS,uint_8 cmdordata);

//=====================================================================
//函数名称：LCDInit
//函数返回：无
//参数说明：无
//功能概要：LCD初始化。
//=====================================================================
void LCDInit()
{
    uint_32 i = 0;
    //从MCU角度，定义控制线与数据线为输出引脚，以便与LCD进行并行数据传输
    gpio_init(LCD_RS, 1,0);
    gpio_init(LCD_RW, 1,0);
    gpio_init(LCD_E, 1,0);
    for(i = 0;i <=7;i++)
    {
        gpio_init(LCD_D[i], 1,0);
    }
    //功能设置（命令）,写指令代码
    LCDCommand(0,0x38);       //5*7点阵模式,2行显示,8位数据总线
    LCDCommand(0,0x08);       //关显示,关光标显示,不闪烁
    LCDCommand(0,0x01);       //清屏
    for (i=0; i<80000; i++)asm("NOP"); //延时
    LCDCommand(0,0x06);
    LCDCommand(0,0x14);       //光标右移一个字符位,AC自动加1
    LCDCommand(0,0x0C);       //开显示,关光标显示,不闪烁
}

//=====================================================================
//函数名称：LCDShow
//函数返回：无
//参数说明：需要显示的数据 
//功能概要：通过液晶显示data中的32字节数据。
//=====================================================================
void LCDShow(uint_8 data[32])
{
    uint_8 i;
    //LCD初始化 
    LCDInit();
    //显示第1行16个字符，后7位为DD RAM地址(0x00)
    LCDCommand(0,0x80);
    //写16个数据到DD RAM
    for (i = 0;i < 16;i++)   //将要显示在第1行上的16个数据逐个写入DD RAM中
    {
        LCDCommand(1,data[i]);
    }
    //显示第2行16个字符 ，后7位为DD RAM地址(0x40)
    LCDCommand(0,0xC0);
    for (i = 16;i < 32;i++)   //将要显示在第2行上的16个数据逐个写入DD RAM中
    {
        LCDCommand(1,data[i]);
    }
}

//----------------------以下为内部函数存放处---------------------------
//=====================================================================
//函数名称：LCDCommand
//函数返回：无
//参数说明：cmdordata，待写命令或数据
//功能概要：向HD44780写cmdordata,且延时。
//=====================================================================
void LCDCommand(uint_8 RS,uint_8 cmdordata)
{
    uint_8 i,temp;
    uint_16 j;
    //发出RS、RW信号
    gpio_set (LCD_RS, RS);
    gpio_set (LCD_RW, 0);
    //等待延迟防止重复调用此函数而LCD卡死
    for (j=0; j<3600; j++);asm("NOP");
    //数据送到LCD的数据线上
    for(i = 0;i <=7;i++)
    {
        gpio_set (LCD_D[i], 0);
    }
    for(i = 0;i <=7;i++)
    {
        temp = 0x01 & (cmdordata>>(i));
        gpio_set (LCD_D[i], temp);
    }
    //给出E信号的下降沿(先高后低),使数据写入LCD
    gpio_set (LCD_E, 1);
    for (j=0;j<25;j++) asm("NOP");
    gpio_set (LCD_E, 0);
}
//----------------------------内部函数结束-------------------------

