#include "common.h"

//===============================================================================
//函数名: usb_read_sector
//功  能: 读取一个扇区
//参  数:sec：扇区号
//      buffer:读取数据的缓冲区
//返  回：0-成功；1-失败
//===============================================================================
int usb_read_sector(uint_32 sec, uint_8 *buffer);

//===============================================================================
//函数名: usb_write_sector
//功  能: 写一个扇区
//参  数:sec:扇区号
//      buffer:存放要写入的数据的缓冲区
//返  回：0-成功；1-失败
//备  注：调用usb_device_transfer函数，该函数内部调用同时作为对外接口函数，由USB主机
//       驱动层相关函数调用
//===============================================================================
int usb_write_sector(uint_32 sec, const uint_8 *buffer);

//===============================================================================
//函数名: usb_device_transfer
//功  能: 执行USB数据读写
//参  数:cmd_length:发送给USB设备的命令长度
//      cmd:发送的命令
//      dir:方向,上行传输还是下行传输
//      buf_length:写或者读缓冲区的长度
//      buf：读/写缓冲区
//返  回：0-成功；1-失败
//备  注：该函数调用USB主机驱动构件函数USBReadData和USBWriteData用于读写操作
//===============================================================================
int usb_device_transfer(uint_8 cmd_length, void *cmd, uint_8 dir,
        uint_32 buf_length, const uint_8 *buf);
