//=====================================================================
//文件名称：isr.c
//功能概要： 中断函数服务例程文件
//版权所有：苏州大学NXP嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2012-11-12   V1.0； 2016-05-08 V6.0 （WYH）
//=====================================================================
#include "includes.h"

//========================中断函数服务例程===============================
//======================================================================
//函数名称：SysTick_Handler（SysTick中断函数服务例程）
//中断条件：根据main函数中的对SysTick初始化，每10ms产生一次SysTick中断，执行本程序
//功能概要：LED刷新、扫描键盘，如有实际按键，在LCD的右下角显示键定义值
//======================================================================
void SysTick_Handler(void)
{
    uint_8 kb;

    LEDshow(g_LEDBuffer);    //LED显示刷新

    kb=KBScanN(10);          //扫描键盘
    if (kb != 0xff)  //有实际按键
    {
        g_LCDBuffer[31] = KBDef(kb);  //填写 LCD缓冲区
        LCDShow(g_LCDBuffer);	              //LCD显示
    }
}

//串口0接收中断服务例程
void UART0_IRQHandler(void)
{

}


//串口1接收中断服务例程
void UART1_IRQHandler(void)
{

}

//串口2接收中断服务例程
void UART2_IRQHandler(void)
{

}
