//===========================================================================
//文件名称：cmp.h
//功能概要：KL25 比较器底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2012-11-25  V1.0   初始版本
//===========================================================================

#ifndef  _HSCMP_H          //防止重复定义（ 开头）
#define  _HSCMP_H

#include "common.h"      //包含公共要素头文件

//===========================================================================
//函数名称：cmp_init
//函数返回 ： 无
//参数说明: reference:参考电压选择  0=Vin1in  1=Vin2in
//         plusChannel: 正比较通道号
//         minusChannel：负比较通道号
//通道号0,1,2,3,4,5对应引脚PTC6,PTC7,PTC8,PTC9,PTC30,PTC29；
//通道6 Bandgap;通道7 DAC输入
//功能概要：CMP模块初始化
//===========================================================================
void cmp_init(uint_8 reference,uint_8 plusChannel,uint_8 minusChannel);

//===========================================================================
//函数名称：dac_set_value
//函数返回：无
//参数说明：value: dac输出的转换值
//功能概要：设置DAC输出值
//===========================================================================
void dac_set_value(uint_8 value);

//===========================================================================
//函数名称：cmp_enable_int
//函数返回：无
//参数说明：无
//功能概要：开比较中断
//===========================================================================
void cmp_enable_int();
	
//===========================================================================
//函数名称：cmp_disable_int
//函数返回：无
//参数说明：无
//功能概要：关比较中断
//===========================================================================
void cmp_disable_int();
	
#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn

