//======================================================================
// 文件名称：led.c                                                          
// 功能概要：led构件源文件
//======================================================================
#include "led.h"

//    ——
//   |__|
//   |  |
//    —— .
//上为8段数码管的示意图，最顶端编号为a段，顺时针旋转下来分别为bcdef段，最中心
//的为g段，右下角的.为h段，数码管显示码为[hgfedcba]形式的一个字节数据。
//下面的数组为共阴极接法下的显示码表，举例说明计算方式：如需要显示数字8，则应
//当h段暗，其他段亮，即h段为0，其他为1，二进制为[01111111]，十六进制为0x7F
//若为共阳极接法，各段值刚好与共阴相反，若需显示8，h段应为1，其他为0，二进制
//形式为[10000000],十六进制形式为0x80;其他显示数字计算方式与此相同。
//显示码表
const uint_8 LEDcodetable[24] =
//   0    1    2    3    4     5    6    7    8    9
  {0x3F,0x06,0x5B,0x4F,0x66, 0x6D,0x7D,0x07,0x7F,0x6F,
//   10   11   12   13   14    15   16   17   18   19  此行为数组下标值
//   0.   1.   2.   3.   4.    5.   6.   7.   8.   9.
   0xBF,0x86,0xDB,0x4F,0x66, 0x6D,0x7D,0x07,0xFF,0x6F,
//   20   21   22      23  此行为数组下标值
//   E    F   (全亮) （全暗）
   0x79,0x71,  0xFF,  0x00};

//led位选端口
const uint_16 led_cs[4]=
{
    LED_CS0,LED_CS1,LED_CS2,LED_CS3
};

//led数据端口
const uint_16 led_d[8]=
{
    LED_D1,LED_D2,LED_D3,LED_D4,LED_D5,LED_D6,LED_D7,LED_D8
};

//=====================================================================
//函数名称：LEDInit
//函数返回：无
//参数说明：无  
//功能概要：LED初始化。即从MCU角度，定义所有线输出，并给出初始值一律为0（全暗）
//=====================================================================
void LEDInit()
{ 
    uint_8 i = 0;
    //定义8根数据线为输出 ，初始输出0
    for(i = 0;i < 8;i++)  gpio_init (led_d[i], 1, 0);
    //定义4位选线定义为输出 ，初始输出0
    for(i = 0;i < 4;i++)  gpio_init (led_cs[i], 1, 0);
}

//=====================================================================
//函数名称：LEDshow
//函数返回：无
//参数说明：data[4]：显示的内容。可显示的数字0~9,0.~9.,E,F,全亮，全暗（见显示码表）
//功能概要：将数组data内容显示在LED上。本函数调用一次会显示数组中的一个字符，
//        因此需延时10ms左右调用一次本函数才能将数组内容全部显示在LED上
//=====================================================================
void LEDshow(uint_8 data[4])
{
    static  uint_8  LEDi=0;    //声明静态变量（位选线索引变量）并赋初值0
    uint_8  i,j,m,n;
    //（1）取待显示数组的第LEDi字节的数据，并转为显示码，赋给m
    j=data[LEDi];        //取待显示数字或序号
    m=LEDcodetable[j];   //使用头文件中常数表，将数字或序号转为显示码
    //（2）在LED的第LEDi位置显示m
    for (i=0;i<=3;i++) gpio_set (led_cs[i], 0);  //位选全部置0（全暗）
    for (i=0;i<=7;i++)          //一个字节数据m上线
    {
        n = (m>>i) & 0x01;       //获得m的一位
        gpio_set (led_d[i], n);  //一位数据上线
    }
    gpio_set (led_cs[LEDi], 1);  //选择的位选线置1（一个字节显示出来了）
    //（3）位选线索引变量LEDi下移一位，并设定LEDi界限
    LEDi++;           //位选线索引变量+1,下次调用，将显示下一个字符
    if (LEDi>=4)  LEDi=0;    //大于4位选线索引变量置0，从头开始
}

