//=====================================================================
// 文件名称：kb.h
// 功能概要：键盘构件头文件
// 版权所有: 苏州大学NXP嵌入式中心(sumcu.suda.edu.cn)
// 版本更新: 2012-06-08 V1.0, 2016-05-12   V6.0（WYH）
//=====================================================================

#ifndef _KB_H         //防止重复定义（_KB_H  开头)
#define _KB_H

#include "common.h"    //包含公共要素头文件
#include "gpio.h"      //包含gpio头文件

//键盘（KB）硬件接线
#define m1  (PTC_NUM | 11)    //4根行线硬件连接
#define m2  (PTC_NUM | 10)
#define m3  (PTC_NUM | 9)
#define m4  (PTC_NUM | 8)
#define n1  (PTC_NUM | 7)     //4根列线硬件连接
#define n2  (PTC_NUM | 6)
#define n3  (PTC_NUM | 5)
#define n4  (PTC_NUM | 4)

//=================接口函数声明=========================================
//=====================================================================
//函数名称：KBInit
//函数返回：无
//参数说明：无
//功能概要：初始化键盘模块。
//=====================================================================
void KBInit(void);

//=====================================================================
//函数名称：KBScanN
//函数返回：键值,无键按下返回0xFF
//参数说明：重复扫描键盘的的次数（scan_cnt），建议1~20之间
//功能概要：多次扫描键盘,返回键值，scan_cnt小于等于1，直接返回扫描1次键值，否则再
//        继续扫描到（scan_cnt*0.5）次相同的键值,且键值不为0xFF时返回该键值，
//        否则返回最后一次扫描值
//======================================================================
uint_8 KBScanN(uint_8 KB_count);

//=====================================================================
//函数名称：KBDef
//函数返回：无
//参数说明：键值valve 
//功能概要：键值转为定义值函数。
//=====================================================================
uint_8 KBDef(uint_8 valve);

#endif     //防止重复定义（结尾）

//=====================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，
//     不足之处，欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学NXP入式中心，0512-65214835，http://sumcu.suda.edu.cn
