//=====================================================================
// 文件名称：led.h                                                         
// 功能概要：led构件头文件
// 版权所有: 苏州大学嵌入式中心(sumcu.suda.edu.cn)
// 版本更新: 2011-03-17  V1.0； 2016-05-02  V6.0（WYH）
//=====================================================================

#ifndef _LED_H           //防止重复定义（开头)
#define _LED_H

#include "common.h"    //包含公共要素头文件
#include "gpio.h"      //包含gpio头文件

//LED的硬件接线
#define LED_D1   (PTB_NUM|11)    //LED数据口
#define LED_D2   (PTB_NUM|10)
#define LED_D3   (PTB_NUM|9)
#define LED_D4   (PTB_NUM|8)
#define LED_D5   (PTB_NUM|3)
#define LED_D6   (PTB_NUM|2)
#define LED_D7   (PTB_NUM|1)
#define LED_D8   (PTB_NUM|0)
#define LED_CS0  (PTB_NUM|19)   //LED位选口
#define LED_CS1  (PTB_NUM|18)
#define LED_CS2  (PTB_NUM|17)
#define LED_CS3  (PTB_NUM|16)

//显示码表（见led.c文件）--0~9之外的序号需要参考此表

//=====================================================================
//函数名称：LEDInit
//函数返回：无
//参数说明：无  
//功能概要：LED初始化。即从MCU角度，定义所有线输出，并给出初始值一律为0（全暗）
//=====================================================================
void LEDInit();

//=====================================================================
//函数名称：LEDshow
//函数返回：无
//参数说明：data[4]：显示的内容。可显示的数字0~9,0.~9.,E,F,全亮，全暗（见显示码表）
//功能概要：将数组data内容显示在LED上。本函数调用一次会显示数组中的一个字符，
//        因此需延时10ms左右调用一次本函数才能将数组内容全部显示在LED上
//=====================================================================
void LEDshow(uint_8 data[4]);

#endif    //防止重复定义（结尾）
//=====================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学嵌入式中心   512-65214835  http://sumcu.suda.edu.cn

