//=====================================================================
//文件名称：key.c
//功能概要：小灯构件源文件
//=====================================================================

#include "key.h"

//=====================================================================
//函数名称：light_init
//函数参数：port_pin：(端口号)|(引脚号)（如：(PTB_NUM)|(9) 表示为B口9号脚）
//       state：设定小灯状态。由light.h中宏定义。
//函数返回：无
//功能概要：指示灯驱动初始化。
//=====================================================================
void light_init(uint_16 port_pin, uint_8 state)
{
    gpio_init(port_pin, GPIO_OUTPUT, state);
}

//=====================================================================
//函数名称：light_control
//函数参数：port_pin：(端口号)|(引脚号)（如：(PTB_NUM)|(9) 表示为B口9号脚）
//       state：设定小灯状态。由light.h中宏定义。
//函数返回：无
//功能概要：控制指示灯亮暗。
//=====================================================================
void light_control(uint_16 port_pin, uint_8 state)
{
    gpio_set(port_pin, state);
}

//=====================================================================
//函数名称：light_change
//函数参数：port_pin：(端口号)|(引脚号)（如：(PTB_NUM)|(9) 表示为B口9号脚）
//函数返回：无
//功能概要：切换指示灯亮暗。
//=====================================================================
void light_change(uint_16 port_pin)
{
    gpio_reverse(port_pin);
}

void key_init(uint_16 port_pin)
{
	gpio_init(port_pin,0,1);//定义为输入引脚
}

uint_8 key_get(uint_16 port_pin)
{
	 return gpio_get(port_pin);//获得输入引脚的输入
}
