//==========================================================================
//文件名称：RTC.h
//功能概要：KL25 RTC底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2016-3-20   V4.0
//==========================================================================
#ifndef _RTC_H
#define _RTC_H

//1 头文件
#include "common.h"

//2 宏定义
//获取中断标志
#define RTC_GET_INVALID_FLAG   ((RTC_SR & RTC_SR_TIF_MASK) == \
                                                         RTC_SR_TIF_MASK)
#define RTC_GET_OVERFLOW_FLAG   ((RTC_SR & RTC_SR_TOF_MASK) == \
                                                         RTC_SR_TOF_MASK)
#define RTC_GET_ALAM_FLAG   ((RTC_SR & RTC_SR_TAF_MASK) == \
                                                         RTC_SR_TAF_MASK)
//清中断标志
#define RTC_CLEAR_FLAG    {RTC_SR &= (RTC_SR_TIF_MASK | RTC_SR_TOF_MASK | \
                                     RTC_SR_TAF_MASK);RTC_TSR = 0;}

//==========================================================================
//函数名称：rtc_init
//函数参数：SecondTimes:秒计数器的初始值
//         AlarmTimes:报警寄存器的时间间隔
//函数返回：无
//功能概要：RTC驱动初始化。时钟源配置为32.768kHz的内部慢速时钟，需要通过导线把
//CLKOUT的PTC3连到RTC_CLKIN的PTC1。
//调用举例：rtc_init(1,2);初始RTC的秒计数器为1，报警值为2。
//==========================================================================
void rtc_init(uint32_t SecondTimes,uint32_t AlarmTimes);

//===========================================================================
//函数名称：rtc_start
//函数参数：无
//函数返回：无
//功能概要：启动RTC模块计时。
//调用举例：rtc_start();启动RTC模块计时。
//===========================================================================
void rtc_start(void);

//===========================================================================
//函数名称：rtc_stop
//函数参数：无
//函数返回：无
//功能概要：停止RTC模块计时。
//调用举例：rtc_stop();关闭RTC模块计时。
//===========================================================================
void rtc_stop(void);

//===========================================================================
//函数名称：rtc_reset_alarm_time
//函数参数：AlarmTimes复位时赋给报警计时器的值。
//函数返回：无
//功能概要：复位报警计时器。
//调用举例：rtc_reset_alarm_time();写入RTC模块报警的新值。
//===========================================================================
void rtc_reset_alarm_time(uint32_t AlarmTimes);

//===========================================================================
//函数名称：rtc_reset_second_time
//函数参数：SecondTimes复位时赋给秒计时器的值
//函数返回：无
//功能概要：复位秒计时器。
//调用举例：rtc_reset_second_time();写入RTC模块计数器的新值。
//===========================================================================
void rtc_reset_second_time(uint32_t SecondTimes);

//===========================================================================
//函数名称：rtc_enable_int
//函数参数：无
//函数返回：无
//功能概要：使能RTC模块中断。
//调用举例：rtc_enable_int();使能RTC模块中断。
//===========================================================================
void rtc_enable_int();

//===========================================================================
//函数名称：rtc_disable_int
//函数参数：无
//函数返回：无
//功能概要：禁止RTC模块中断。
//调用举例：rtc_disable_int();禁止RTC模块中断。
//===========================================================================
void rtc_disable_int();

#endif


//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
